[
    {
       "id":1,
       "title":"My love for nature reserves",
       "tags":[
          "personal",
          "nature",
          "walk",
          "lifestyle"
       ],
       "teaser_content":"I have been to a variety of nature reserves in Cambridge throughout the years. Here are some highlights.",
       "full_content":"Most Accessible Park Award goes to: Milton Country Park. It has toilets, food and ice cream in the main area, as well as a relatively decent circuit that isn't too hard to follow!",
       "additional_content":[
          "Personal Go-to Nature Reserve award goes to: Trumpington Meadows Park! It has a nice stretch along the M11, in addition to being a really beautiful park!",
          "Most Beautiful Local Nature Reserve goes to: Cherry Hinton Chalk Pits! Its magnificent stones create such a beautiful surrounding."
       ],
       "created_by":"Demie Mistica",
       "dateTime_created":"29/01/2024, 19:33",
       "dateTime_updated":"29/01/2024, 19:33",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/NatureReserve4.jpg",
             "caption":"Milton Country Park, Cambridge",
             "is_main_image":1
          },
          {
             "file_path":"/images/NatureReserve2.jpg",
             "caption":"Trumpington Meadows Park",
             "is_main_image":0
          },
          {
             "file_path":"/images/NatureReserve3.jpg",
             "caption":"Cherry Hinton Chalk Pits",
             "is_main_image":0
          },
          {
             "file_path":"/images/NatureReserve.jpg",
             "caption":"Trumpington Park, Opposite the M11.",
             "is_main_image":0
          },
          {
             "file_path":"/images/NatureReserve5.jpg",
             "caption":"Ouse Fen, Earith.",
             "is_main_image":0
          }
       ]
    },
    {
       "id":2,
       "title":"Visit to Campfire",
       "tags":[
          "personal",
          "social",
          "lifestyle"
       ],
       "teaser_content":"I've gone to a campfire near a local nature reserve. It was nice getting to meet new people!",
       "full_content":"With January coming to a close, I'd thought to come by and visit this nice campfire. It was the first time I've roasted a marshmallow, and had a proper cuppa in a campfire!",
       "additional_content":[
          "During the campfire gathering, we roasted marshmallows, greeted each other by choosing an item of choice. From buckets, trains, frogs, etc., I chose the rainbow flag, as I envisioned an inclusive and welcoming world.",
          "The poem, named Wild Geese, was also lovely to read. It highlights the importance of community and also being able to dive into what you enjoy.",
          "The event takes place at Byron's Pool LNR at the car park, every 4th Saturday of each month. Come check them out, you won't regret it!"
       ],
       "created_by":"Demie Mistica",
       "dateTime_created":"29/01/2024, 21:07",
       "dateTime_updated":"29/01/2024, 21:07",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/Campfire.jpg",
             "caption":"Campfire near Trumpington Meadows Park",
             "is_main_image":1
          },
          {
             "file_path":"/images/Campfire_Me.JPG",
             "is_main_image":0
          },
          {
             "file_path":"/images/Campfire_Marshmallow.JPG",
             "caption":"Roasting a marshmallow at 24, better late than never!",
             "is_main_image":0
          },
          {
             "file_path":"/images/Campfire_Poem.JPG",
             "caption":"A poem someone gave me during my stay.",
             "is_main_image":0
          },
          {
             "file_path":"/images/Campfire_Sunset.JPG",
             "caption":"The looming sunset after I left.",
             "is_main_image":0
          }
       ]
    },
    {
       "id":3,
       "title":"6km Walking Workout",
       "tags":[
          "personal",
          "nature",
          "walk",
          "lifestyle"
       ],
       "teaser_content":"I embarked on a 1.5hr journey, encountering muddy terrain along the way.",
       "full_content":"This is one of the longest walks I've done in 2024 so far, and I am pretty proud of that. Any progress is progress and I believe firmly that putting any effort is better than none.",
       "created_by":"Demie Mistica",
       "dateTime_created":"29/01/2024, 21:15",
       "dateTime_updated":"29/01/2024, 21:15",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/6KM_3.jpg",
             "is_main_image":1
          },
          {
             "file_path":"/images/6KM_Selfie.jpg",
             "is_main_image":0
          },
          {
             "file_path":"/images/6KM_2.jpg",
             "is_main_image":0
          },
          {
             "file_path":"/images/6KM_4.jpg",
             "is_main_image":0
          },
          {
             "file_path":"/images/6KM_Workout.png",
             "is_main_image":0
          }
       ]
    },
    {
       "id":4,
       "title":"Taking Ownership in 2024",
       "tags":[
          "introspection",
          "mental-health"
       ],
       "teaser_content":"Here are my hardships I faced in 2023, which I will conquer in 2024.",
       "full_content":"Firstly, my spending habits were dominant. Money became a double-edged sword for my mental health, that I am going to put it to the side. Society and media filled my head with so many choices that it made me feel wealthier than I actually am. To me, pointing this out feels liberating, as it shows the potential I have to control my finances. \n\n Secondly, I overrelied on others. I became too dependent on people's positive feedback. I have a hard time making my own decisions sometimes when put under a lot of pressure.\n\nA part of growing up in my opinion is learning how not to let things get to you. It may be difficult at the beginning, but it's a skill just like anything else.\n\nTaking ownership also means taking responsibility. For me, independence is something to embrace. That's not to say that things will be okay as a one man army, but it'll strengthen my confidence in the long run.\n\nThis post may not be as light-hearted as most of my other ones, but that's okay. The big picture to look at here is that if you're content, do what you can to improve.",
       "created_by":"Demie Mistica",
       "dateTime_created":"30/01/2024, 01:38",
       "dateTime_updated":"30/01/2024, 01:38",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/LookingAtDesktop.jpg",
             "is_main_image":1
          }
       ]
    },
    {
       "id":5,
       "title":"Time at Coding Bootcamp",
       "tags":[
          "education",
          "web-dev"
       ],
       "teaser_content":"What I've done and learnt during my time here.",
       "full_content":"Starting from August of 2023, I booked my taster session with the folks at Tech Educators. First impressions were in, and I knew this course was going to change my life for the better.\n\n One month later, the course jumpstarted with a lesson on Markdown. My nerves were kicking in, but managed to keep my cool on the first day back. Meeting people from different kinds of backgrounds and skill levels, it was refreshing to see everyone thrive in a fully positive and inclusive environment.\n\n To this day, this coding bootcamp has shaped the way I've looked at education in general. That there IS hope out there, and if you work hard and stay calm under pressure, you can achieve the best of work.\n\nThe bootcamp taught me that social connections are most certainly possible, with the right group, place, and time. That's not to say that a bootcamp is always going to be a life-changing experience, but it can help guide you in the right direction.\n\n(UPDATE: July 2024)\nEver since I graduated 7 months ago, I've had an itching curiosity that just won't stop growing. I feel like it's thanks to this bootcamp that I've not given up my passion for coding entirely.",
       "created_by":"Demie Mistica",
       "dateTime_created":"03/02/2024, 00:45",
       "dateTime_updated":"03/02/2024, 00:45",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/Bootcamp_Campus.jpg",
             "caption":"The Bradfield Centre, Science Park, Cambridge.",
             "is_main_image":1
          },
          {
             "file_path":"/images/Bootcamp_Campus2.JPG",
             "caption":"Near the campus is a lovely pond.",
             "is_main_image":0
          },
          {
             "file_path":"/images/Bootcamp_Bridge.JPG",
             "caption":"A nice bridge, a walk from the campus.",
             "is_main_image":0
          },
          {
             "file_path":"/images/Bootcamp_Campus3.JPG",
             "caption":"The Bradfield Centre, but at another angle.",
             "is_main_image":0
          },
          {
             "file_path":"/images/Bootcamp_Graduation.JPG",
             "caption":"Graduation day! 1st Dec 2023.",
             "is_main_image":0
          }
       ],
       "additional_images":[
          {
             "file_path":"/images/MTACB_1.JPG",
             "heading":"Inside The Bradfield Centre",
             "caption_img":"The campus in Cambridge.",
             "caption_outside":"It feels like yesterday since I've been here, but in reality it's been months!",
             "text_content":"The bootcamp campus in of itself gives me bittersweet memories. While I mostly attended my bootcamp sessions online, the times I've been here made me feel like I was in a different dimension. In a way, it feels good to be reminded of past obstacles that you've conquered so that you know how far you've come.",
             "alignment":"end",
             "obj_cover":"bottom",
             "position_y":"0px"
          },
          {
             "file_path":"/images/MTACB_COMPLETION.png",
             "heading":"After the Bootcamp",
             "caption_img":"Certificate",
             "caption_outside":"The bootcamp taught me a lot of things I wouldn't have otherwise known as someone experienced with PHP.",
             "text_content":"I still hang around the Tech Educators community from time to time, meeting new cohorts from time to time. If it weren't for the employment team motivating me to put more commits to GitHub, I would've not made this website and challenged myself altogether.",
             "alignment":"end",
             "obj_cover":"center",
             "position_y":"0px"
          }
       ]
    },
    {
       "id":6,
       "title":"My Autistic Self",
       "tags":[
          "mental-health",
          "personal"
       ],
       "teaser_content":"My personal experiences being autistic.",
       "full_content":"<t>Have you tried the accessibility buttons on the top right (or hamburger menu on mobile)? The first button activates dark/light mode, whereas the second is a 'dyslexic-friendly' font! Give them a go!</t>\nDefinitely haven't written this at 2:30am without some compelling reason!\n\n From my experience, autism isn't something I would take away but rather acknowledge that it's going to be a lifelong condition. And that's okay! While I see myself as needing extra accomodations at times to help me regulate my tasks and mood, this shouldn't stop me from reaching my full potential.\n\nI have special interests, but I don't really have the ability to 'infodump' about them because of how hard they are to explain to people.\n\nAutism has made me accept imperfections in my life, that I especially can't control. For instance, I can't control inflation. I focus on what I can control instead.\n\nFor example, it's much easier to control my mood. Whether it'd be from taking deep breaths, to taking things more slowly than usual.\n\nI feel like being understood for who I am comes with the neurodiverse package as well, but also being mindful that it won't necessarily restrict my decision-making. I don't expect the world to accomodate for me.\n\nIn my opinion, I find the word 'neurotypical' rather hostile. It's sort of like treating them as if they have no way of thinking outside the 'norm'. It's also the same for neurodivergence. While I can't necessarily come up with a more 'appealing' name for both terms, I do think that one phrase stands out the most- 'Human.' we are going to experience emotionally driven decisions either way.\n\nThis is not a call for people to pick on others because of their brain structures.\n\nAs an autistic person, I don't directly advocate for more acceptance. I advocate for people however, to be more mindful. To tap into our innate empathy. If you were in someone else's shoes, who was overwhelmed by loud noises and bright lights, would you tell them to just 'snap out of it'?\n\nAlso, I want to clarify that my personal experiences of autism are unique, but does NOT translate to quirkiness. You can view autism or neurodivergence however you wish, but what it shouldn't be regarded as, in my honest opinion, is to use it as an excuse for bad behaviour.\n\nFor me, It took way too long to realize that the only person who can turn their own life around is themselves. If I don't look after myself, I will become more pessimistic, and in turn, poor mental health arises.",
       "created_by":"Demie Mistica",
       "dateTime_created":"07/02/2024, 02:25",
       "dateTime_updated":"19/04/2024, 03:07",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/MAS_CNRThumbsUp.JPG",
             "caption":"Nature Reserves + Demie = Perfection.",
             "is_main_image":1
          },
          {
             "file_path":"/images/HeadphonesCollection.JPG",
             "caption":"Music is ESSENTIAL, but I admit, this is a lot of cans.",
             "is_main_image":0
          },
          {
             "file_path":"/images/MAS_Carbonara.JPG",
             "caption":"My deep interest in cooking, especially pasta, is the thing I strive for.",
             "is_main_image":0
          },
          {
             "file_path":"/images/MAS_Shadow.JPG",
             "caption":"It's okay not to be okay.",
             "is_main_image":0
          },
          {
            "file_path": "/images/rosetintedglasses2.jpg",
            "caption": "Imagine autism as a different lens, that one cannot take off.",
            "is_main_image": 0
          }
       ],
       "additional_images":[
          {
             "file_path":"/images/MAS_FoodCollection.png",
             "heading":"Special Interest #1 - Food",
             "caption_img":"Food. Lots of it.",
             "caption_outside":"If there's one thing that I need to reduce, is the amount I spend on eating out.",
             "text_content":"Now, this is a lesson learnt late, but better late than never.\n\nSometimes, my understanding of consequences is impaired, therefore I tend to spend unreasonable amounts of money on takeout. And look, while autism isn't something I'd take away from myself, I do feel like taking responsibility should be a key element of who I am.\n\nHowever, due to traumatic past experiences, the takeout addiction has become a major coping mechanism.",
             "alignment":"end",
             "obj_cover":"center"
          },
          {
             "file_path":"/images/sensoryoverwhelm.jpg",
             "heading":"Why Executive Dysfunction is my worst enemy",
             "caption_img":"Being overloaded can stop me from doing important tasks.",
             "caption_outside":"Sensory overload is often the main reason why I can't get things done a majority of the time.",
             "text_content":"Executive dysfunction is a nicer term than 'laziness' ever will be. It's a way of saying that every time functioning can't exist, that there is a reason behind it.\n\n<q>Being neurodivergent or normal can be like collecting Infinity Stones, as everyone of us is different.<a>Demie</a></q>For me especially, I need a good reason to start doing chores otherwise I won't really do them. Sometimes I may FORGET the reason why they are important because I'm very focused on something else, whether it'd be writing on this website to playing video games!",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          }
       ]
    },
    {
       "id":7,
       "title":"Embracing Yourself",
       "tags":[
          "mental-health",
          "personal",
          "ai"
       ],
       "teaser_content":"A long-winded article on my struggles, and attempting to overcome them.",
       "full_content":"I've opted-in the rat race. I'm trying to catch my breath against the bullet train named 'Technological Advancements.' A lot of the things I've learnt over the years, can now be summarized by a chatbot who can shove its encyclopedia of answers right in front of our fingertips.\n\nAs much as I'd love to embrace AI, there's a lot of questions left in my mind that I've barely even asked throughout my life, because I was too busy pursuing those dreams.\n\nEmbracing myself was when I knew when to stop pursuing that train. That really the worst enemy was myself, my ego, and how these two affect others around me.\n\nMy biggest fear is coming across as someone who always looks out for themself, and never anybody else. That is one of the main reasons why I get out of bed everyday. While comfort is really important, embracing the unknown and taking risks is vital to spicing up life.\n\nBattling my worst perception of myself is difficult. I also feel like making mental health an important focus of my personality makes me feel like a boring person.\n\nBut this hasn't stopped me from trying. Here's something I say to myself every now and then.\n<q>A part of growing up is learning not to give a f**k what other people think, because people don't put effort into your goals, it's YOU that's putting the effort.<a>Demie</a></q>",
       "created_by":"Demie Mistica",
       "dateTime_created":"15/02/2024, 18:48",
       "dateTime_updated":"15/02/2024, 18:48",
       "grid_format_id":"1",
       "is_new":1,
       "images":[
          {
             "file_path":"/images/EY_Portrait.jpg",
             "is_main_image":1
          }
       ]
    },
    {
       "id":8,
       "title":"Blossoming to Independence",
       "tags":[
          "mental-health",
          "independence"
       ],
       "teaser_content":"I'm 24 as of writing this, and I still haven't grasped the concept of adulthood. Now's the time to embrace it.",
       "full_content":"I feel like time has frozen so much in my life. The concept of responsiblity has only just existed in my headspace for such a short time, that I haven't had any time to truly master what it really feels like to be independent.\n\nThat being said, I don't intend on stopping my pursuit of growth and solitude. Change IS scary. But not all things that are scary are necessarily bad.\n\nWhen someone asked me how I felt taking the bus in this village for the first time\n I replied:<q>Regardless of how I feel right now, I have to take the bus there. No amount of anxiety can change that.<a>Demie</a></q>I thought, that getting home was more important than whatever anxiety I had, which I think shows a lot of personal growth.\n\nWhile my walks at the local park are still there, I still don't feel like I'm fully engaging with life. I feel like parts are still missing, like taking ownership.\n\nIndependence is something we do at times, even when we don't realize it. The decision to take the bus from somewhere unfamiliar to my house was an independent decision.\n\nI could've decided to walk the whole trek too, which is an independent decision as well, albeit not the most optimal.",
       "created_by":"Demie Mistica",
       "dateTime_created":"15/04/2024, 22:12",
       "dateTime_updated":"15/04/2024, 22:12",
       "grid_format_id":"1",
       "is_new":1,
       "images":[
          {
             "file_path":"/images/IMG_9789.JPG",
             "caption":"A brave new world awaits.",
             "is_main_image":1
          },
          {
             "file_path":"/images/messydesk.JPG",
             "caption":"There IS a world outside this computer. Just gotta embrace that.",
             "is_main_image":0
          },
          {
             "file_path":"/images/IMG_9766.JPG",
             "caption":"The world is a much better place when you are in nature.",
             "is_main_image":0
          },
          {
             "file_path":"/images/PublicTransport.JPG",
             "caption":"Taking the bus in an unfamiliar place is not so daunting as I thought it would be.",
             "is_main_image":0
          },
          {
             "file_path":"/images/MovingInHouse.jpg",
             "caption":"My first time moving out. July 2021.",
             "is_main_image":0
          }
       ],
       "additional_images":[
          {
             "file_path":"/images/PoundBills.jpg",
             "heading":"Money Matters",
             "caption_img":"CHRISTOPHER BILL",
             "caption_outside":"Money is a very sensitive subject, but nevertheless is a necessary evil.",
             "text_content":"The part that I struggle with the most is with money. I spend it like there's no tomorrow. Now I want to change this. Start setting budgets, and being responsible you know?\n\nOne of my strongest habits is letting my finances define my mental health, when really, regardless of whatever I have, I should try to be optimistic at all times.\n\nIt's just for some reason, I blame anyone but myself for my situation. Now it's my turn to pick the pieces up and sort it out. In truth, ",
             "alignment":"end",
             "obj_cover":"center"
          },
          {
             "file_path":"/images/EY_Bins_Smaller_Portrait.png",
             "heading":"Taking out the trash",
             "caption_img":"Me taking out the garbage outside my house.",
             "caption_outside":"This is something I should be doing more often, but often forget to do. Self-neglect is a real villain sometimes. Even basic tasks like taking out the trash are monumental, in a good or bad way.",
             "text_content":"There are times that I have managed basic tasks, like taking out the trash, without fear or judgment holding me back. I long for those days.\n\nThe things that are really stopping me from doing this on a regular basis is lack of motivation or purpose. And I think it's okay to tell people this, rather than having to hide my true self in exchange for superficial professionalism. In other words, I think it's okay to show weakness in public, for as long as you find ways of coping or reducing them.\n\n",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          }
       ]
    },
    {
       "id":9,
       "title":"My Web Design Tenets",
       "tags":[
          "programming",
          "web-dev"
       ],
       "teaser_content":"An overview of how I design websites, and how to build beyond these skills.",
       "full_content":"I want to say that, from my personal experience, building websites is a skill in of itself.\n It's also another skill to inspire others to do the same.\n\nWhen building a portfolio website in particular, I don't really have any set rules on how I present myself. In fact, I want honesty and transparency to be the driving force and passion on how I build this website.\n\nLet me be clear though, you do NOT HAVE to know how to use HTML, CSS, and Javascript to make a website. These particular web-design languages are useful, but not essential. However I would highly recommend doing them, as it will help you to understand how websites work in general.\n\nHere are some of the fundamentals I would follow, in any project.\n\n",
       "created_by":"Demie Mistica",
       "dateTime_created":"19/04/2024, 21:10",
       "dateTime_updated":"19/04/2024, 21:10",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/MPS_Cover.JPG",
             "caption":"Visual Studio Code, my beloved.",
             "is_main_image":1
          }
       ],
       "additional_images":[
          {
             "file_path":"/images/MAS_TTTSBAW.jpg",
             "heading":"1. Have a design or goal in mind",
             "caption_img":"The goal can be as simple as having an outlet, to something more like creating a community.",
             "caption_outside":"Websites are what you make of them, Don't let your fears hinder you from trying.",
             "text_content":"When I made this website, I only really had one goal in mind, which is to have a place to write and provide advice from experience. Your goals are probably going to be different, so think carefully what you want to get out when you make a website.",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          },
          {
             "file_path":"/images/MPS_TechStack.png",
             "heading":"2. Build your tech loadout",
             "caption_img":"React, PHP, MySQL, what the heck are these exactly!?",
             "caption_outside":"This may look daunting, but you only really need to pick like a select few.",
             "text_content":"Credit to: https://novateus.com/blog/what-is-a-tech-stack-how-can-you-choose-one-for-your-project/\n\n",
             "alignment":"end",
             "obj_cover":"center"
          }
       ]
    },
    {
       "id":10,
       "title":"Untapped Potential",
       "tags":[
          "mental-health",
          "positivity"
       ],
       "teaser_content":"Believe it or not, there is so much potential within you. You just have to unlock it.",
       "full_content":"To be honest, I've never really thought I had it in me to walk a total distance of 21km within a week, but here I am, standing tall and proud of that achievement.\n\nIt wouldn't have been done without the inspiration and motivation given by my friends and the music I listen to.\n\nIn the midst of all this, I realized something was instrumental in all of this, and that was the power of inspiration and role models. I look up to my friends for strength and guidance. Everybody is different and may have different ways to motivate themselves, however I found inspiration to be the most effective.\n\nCombined with the ability to have a sense of future self, I feel like that's what is currently sparking my untapped potential. It's like a golden age for me, that no depression can ever touch.",
       "created_by":"Demie Mistica",
       "dateTime_created":"30/06/2024, 20:28",
       "dateTime_updated":"30/06/2024, 20:28",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/UP_SELFIECOVER.JPG",
             "caption":"To tap into untapped potential is like mining gold.",
             "is_main_image":1
          },
          {
             "file_path":"/images/UP_COVER.JPG",
             "caption":"",
             "is_main_image":0
          },
          {
             "file_path":"/images/UP_2.JPG",
             "caption":"Addenbrookes, Cambridge.",
             "is_main_image":0
          },
          {
             "file_path":"/images/UP_3.JPG",
             "caption":"Addenbrookes, Cambridge.",
             "is_main_image":0
          },
          {
             "file_path":"/images/UP_EXERCISE2.PNG",
             "caption":"A total of 1,021kcal burnt, and 8.69km walked. Nice.",
             "is_main_image":0
          }
       ],
       "additional_images":[
          {
             "file_path":"/images/UP_EXTRA1.JPG",
             "heading":"Spontaneous Growth",
             "caption_img":"Aura, Cambridge",
             "caption_outside":"Sometimes growth spirals and snowballs out of control.",
             "text_content":"Life can throw curveballs at you, but you've got to see your life going at an upward angle. Sure you may have your lowest moments at times, but try to see today's version of you as better than the one before. It's most certainly possible to change your surroundings, you just have to be willing to do whatever it takes to get to that stage.\n\nI have a hard time when it comes to doing this, because I tend to compare my past self to my present self and think that it's better in some ways. Which may be true, but if that was the case, then I should find the reasons for why that may be the case, then try to improve my future self.",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          },
          {
             "file_path":"/images/UP_GA.JPG",
             "heading":"Finding the light at the end of the tunnel",
             "caption_img":"Trumpington Meadows Park, Cambridge",
             "caption_outside":"I understand what it means to live a full life now. And it has little to do with how much you earn. It's about finding what you want to live for.",
             "text_content":"And what I mean by the caption above, is that, you should find reasons to motivate yourself, for good mental health is a solid foundation to making great things happen.\n\nWith the introduction of walks during the summer for example, my mind has felt clearer and more able to understand that my life will have ups and downs. It's about riding the wave that matters. I can't really speak for those with depression since I don't really have it, but I can empathize with the fact that hope can be lackluster.\n\nThat's why, carving your own destiny, if your circumstances allow it, is the best way forward. I do feel that at times, negativity creates this 'fog' that makes it hard to see what you envision for yourself. However, given the right tools to correct this, you can make and achieve your goals.\n\nI'm not gonna say you're out of luck, as that creates fatalism. For me I've been dealt a pretty good hand, but regardless of our circumstances, find out how to unlock your untapped potential regardless of where you are. That's what creates a strong person. It's not about how much silver spoons you have, but rather how much you can pull through.",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          }
       ]
    },
    {
       "id":11,
       "title":"Financial Frustrations",
       "tags":[
          "money",
          "personal"
       ],
       "teaser_content":"The cost of living is speeding while I'm doing the legal limit; it's criminal, and cannot be ignored.",
       "full_content":"And crossing the legal limit when I shouldn't feels like a hazard- Money is such a pain to deal with. I feel like part of it is by design. I mean credit cards exist, as well as those buy now pay later schemes too. Just when you feel like you're in control of your finances, some emergency pops out of nowhere and you have to pay out of pocket- whether it'd be a car fault, to health complications... It's such a kick in the bollocks.\n\nWhen it comes to pain, nothing compares to not having the basic needs available to you right at hand- food, drink and shelter etc. I've heard there is enough for everyone to be fed adequately in this world but due to how distribution works we've screwed that up.\n\nI will say though, despite my utterly crap relationship with money, I want to share some lessons that I want to tell my younger self, and to anyone who's really struggling out there to make every penny count.",
       "created_by":"Demie Mistica",
       "dateTime_created":"03/07/2024, 01:50",
       "dateTime_updated":"03/07/2024, 01:50",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/FF_COVER_HD.png",
             "caption":"Whenever money is involved, my brain blows out.",
             "is_main_image":1
          }
       ],
       "additional_images":[
          {
             "file_path":"/images/FF_NOTAKEAWAYS.png",
             "heading":"Culprit #1 - Takeaway companies",
             "caption_img":"#FREEFROMTAKEAWAYS",
             "caption_outside":"Sometimes, losses are victories, and shying away from takeaways is always a good thing.",
             "text_content":"I don't want to make you feel powerless over your finances. In fact, one of the categories I struggle with and I feel like is a matter of self-control, is takeaways. I've been struggling to put them away endlessly for years and months on end that I've lost count on how much money I've lost from buying crap from them.\n\nTo be honest I don't care if I'm BANNED from using their apps, I wish that was a real thing. Their predatory marketing makes it so you feel like treating yourself out of pocket, when really, a majority of takeouts can lead to a spiralling spending spree. At least for me that's what happened when 21 year old me lacked discipline at the time. And guess what? My future self would be ashamed to have so much food right in front of me that it becomes so hard to maintain how much I'm eating.\n\nAnd to tell you the truth, I spend hundreds a month on takeaway, when I should be learning how to cook easy and simple meals at home!",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          },
          {
             "file_path":"/images/FF_OSTRICH2.png",
             "heading":"Culprit #2 - The Ostrich Effect",
             "caption_img":"What you have left in your pocket is more important than comfort.",
             "caption_outside":"This is unfortunately true, as I've avoided financial responsibility for a long, long time.",
             "text_content":"Now this is more of me blaming myself, but needless to say, financial responsibility starts with you. It's not easy to partake financial matters when:\n\na) you have little control over your money\nb) you're living cheque to cheque\nc) you overspend a lot of the time\n\nHOWEVER, it's better to try to investigate reasons for these rather than burying your head in the sand pretending everything will all be okay. I know this from experience and I should know better to not evade this responsibility, no matter how uncomfortable I am with the situation.",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          },
          {
             "file_path":"/images/FF_BUDGETING.png",
             "heading":"Solution #1 - Budgeting Techniques",
             "caption_img":"Always know your what your income and expense figures are.",
             "caption_outside":"I've always been hiding from budgeting because I feel like I'm already saving without putting in much effort. Truthfully this isn't the case anymore and I should've budgeted right from the start.",
             "text_content":"Sometimes simple dishes taste better than overcomplicating things. It's the same with budgeting, you don't need to overanalyze every single transaction that you process throughout your daily life. Just have a rough plan of what you want out of your budget, say saving at least £10 every time you do grocery shopping for instance. You could do this by switching to non-branded goods, as an example.\n\nSure there may be a noticeable difference in the quality of the food you eat but it'll definitely help your wallet in the long run.\n\nI'm pretty sure that by reading this article that you are either looking to relate or find a solution. In which case, I feel like the solution should start with a firm foundation. Try other budgeting websites like Martin Lewis' one as I'm not too versed into the budgeting world. I'm just a guy venting their frustrations.",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          }
       ]
    },
    {
       "id":12,
       "title":"Overcoming My Fears",
       "tags":[
          "personal",
          "positivity"
       ],
       "teaser_content":"I cannot ignore this void that needs to be addressed. Light is there at the end of the tunnel.",
       "full_content":"I will warn anyone reading this, that this is a pep talk more than anything else.\n\nFor years, I've told myself that I'm not worthy enough to do anything with my life. Years of that suffering has left me crippled and unable to do anything substantial. As much as I love to rely on 'realistic thinking'- which is, to have a balanced positive and negative perspective, that is impossible to have at a constant.\n\nI've lied to you in the first paragraph already, because my achievements have spoken loud and clear that I'm not a complete failure. I'm going to be completely honest though, I can and will do better to achieve my goals. If I EVER feel like crap, I'll just pop back to this article and tell myself, that my achievements and how far I've come, is not a sign to give up.",
       "created_by":"Demie Mistica",
       "dateTime_created":"08/07/2024, 10:23",
       "dateTime_updated":"08/07/2024, 10:23",
       "grid_format_id":"1",
       "images":[
          {
             "file_path":"/images/OMF_TUNNEL.jpg",
             "caption":"As much as I hate the saying, I feel it's true.",
             "is_main_image":1
          }
       ],
       "additional_images":[
          {
             "file_path":"/images/OMF_WALKING.jpg",
             "heading":"Overcoming My Own Worst Enemy - Myself",
             "caption_img":"I don't often look at the mirror, but I believe I can be a nuisance to myself.",
             "caption_outside":"However, that doesn't mean it's a sign for me to give up.",
             "text_content":"This page is for people who've tried so hard, but feel like they haven't done good enough. I'm not going to give myself empty promises, I'm going to commit to them fully and hopefully one day overcome my worst fears. I really think that the worst part of myself is that I'm thinking that I'm not capable enough when I truly am.\n\nThe reason why I haven't fully given up, is because I have:\n- A driver's licence, so I can go anywhere I need to.\n- Confidence to do anything when given the right opportunity\n- Passion that won't extinguish easily.",
             "alignment":"end",
             "obj_cover":"center",
             "height":"600px",
             "position_y":"-250px"
          },
          {
             "file_path":"/images/FF_OSTRICH2.png",
             "heading":"Overcoming My Fear of Responsibility",
             "caption_img":"Imagine this is me, burying my head in the sand.",
             "caption_outside":"I can't keep burying myself like this, for I feel it's cowardly.",
             "text_content":"I might have poor decision making skills but surely it won't like this forever. I think I can conquer anything with the right attitude. Let's put things into perspective shall we?\n\nFor instance, with budgeting, just put some money aside for the rent and other unavoidable expenses, then further divide the other budget into important stuff like groceries etc. The remaining budget is your savings, that you should not touch. It's not too hard to grasp.\n\nI should also be able to do house chores more easily given that I'm alone and can concentrate.",
             "height":"450px",
             "alignment":"end",
             "obj_cover":"top",
             "position_y":"-150px"
          },
          {
             "file_path":"/images/OMF_VICTORY.jpg",
             "heading":"The Outcome - A Better Me.",
             "caption_img":"Everyone deserves a moment like this.",
             "caption_outside":"This is my kind of victory, the one where you feel you can confidently raise your hand in triumphant glory in the basking sun.",
             "text_content":"This may sound like an oddly specific type of victory, but trust me, this is what I truly want out of life. It isn't necessarily the paycheck or the hobbies that I enjoy the most, it's just being able to confidentally say 'I did it.' to myself, and maybe to others as well.<q>Life isn't about how hard you get it, it's about how hard you GET hit and keep moving forward.<a>Rocky Balboa</a></q>",
             "height":"450px",
             "alignment":"end",
             "obj_cover":"center",
             "position_y":"-150px"
          }
       ]
    },

    {
      "id":13,
      "title":"Put Yourself First",
      "tags":[
         "mental-health",
         "positivity"
      ],
      "teaser_content":"Keep this in mind, and you can achieve anything.",
      "full_content":"<t>Have you tried the accessibility buttons on the top right? The first button activates dark/light mode, whereas the second is a 'dyslexic-friendly' font! Give them a go!</t>\nI know what I just said will create a bit of controversy, but I said it. Treat yourself, when it's warranted. It's so important to be able to do things for yourself in a world that is dictated by routine and order.\n\nI find that other people can only do so much to help you. But... <q>If you can't love yourself, how in the hell can you love somebody else?<a>RuPaul</a></q>I think it's so important to understand that just because you put yourself first, it doesn't mean you are doing it at the expense of others.\n\nI'll go further and say that you don't even have to love yourself, but just accept yourself for who you are, including your perks and flaws.",
      "created_by":"Demie Mistica",
      "dateTime_created":"13/07/2024, 22:24",
      "dateTime_updated":"13/07/2024, 22:24",
      "grid_format_id":"1",
      "images":[
         {
            "file_path":"/images/treatyourself_cover2.JPG",
            "caption":"When possible, delve into what makes you happy. Even through food.",
            "is_main_image":1
         }
      ],
      "additional_images":[
         {
            "file_path":"/images/TYF_1.JPG",
            "heading":"Take care of yourself physically",
            "caption_img":"Local Nature Reserve",
            "caption_outside":"Walking in nature is one way for me to destress and get fitter.",
            "text_content":"I normally take walks and listen to music because it empowers my mental health. It's such a good way to start the day that it can motivate me to do other things.\n\nTaking care of yourself physically doesn't just have to include exercise. It can also include eating foods that feel right. For example, pizza may not be the healthiest food out there for me, but it screams comfort food for me that I think it's okay to have it every now and then. (Once-twice a week). At other times, I'll just have something healthier like a sandwich!",
            "alignment":"end",
            "obj_cover":"center",
            "height":"450px",
            "position_y":"-250px"
         },
         {
            "file_path":"/images/treatyourself_tr.jpg",
            "heading":"Take Responsibility",
            "caption_img":"Your life is your very own.",
            "caption_outside":"Taking responsibility is one of the most powerful things you can do to increase your independence.",
            "text_content":"To be responsible for yourself means you show a lot of emotional maturity. If you have to do something you need to do, even if you don't feel comfortable doing it, like doing chores or taking a shower, that discomfort will trade off in the end.\n\nDon't let other people (even myself) tell you what you should do with your life. Do something that you feel aligns best with your values. This article is just a small reminder, to just put yourself first.",
            "height":"500px",
            "alignment":"end",
            "obj_cover":"top",
            "position_y":"-150px"
         }
      ]
   },

   {
      "id":14,
      "title":"Move With Pressure",
      "tags":[
         "mental-health",
         "improvement"
      ],
      "teaser_content":"Put pressure on yourself: To learn, to grow, and to live. Because you're important.",
      "full_content":"<t>Have you tried the accessibility buttons on the top right? The first button activates dark/light mode, whereas the second is a 'dyslexic-friendly' font! Give them a go!</t>\nI've gone through a lot of hardship in my life, only to realize now that living it is not going to be easy. I've said it, put pressure on yourself to improve and grow. Learn a new language, new instrument or go to that networking event you've probably been dreading to go. It will be worth the effort!",
      "created_by":"Demie Mistica",
      "dateTime_created":"10/09/2024, 18:46",
      "dateTime_updated":"10/09/2024, 18:46",
      "grid_format_id":"1",
      "images":[
         {
            "file_path":"/images/MWP_HERO.JPG",
            "caption":"Even through the tough times, smiles release endorphins.",
            "is_main_image":1
         },

         {
            "file_path":"/images/MWP_MAIN1_MOTORWAY.JPG",
            "caption": "Think of your mind as the motorway- it's fast, but your body needs to be able to catch up."
         },

         {
            "file_path":"/images/MWP_MAIN2_ROYAL.JPG",
            "caption": "Statues leave a legacy behind. What will yours be?"
         },

         {
            "file_path":"/images/MWP_MAIN3_TRAIN.JPG",
            "caption": "My first time using the train outside of family, Aug 2024."
         },

         {
            "file_path":"/images/MWP_MAIN4_WINDMILL.JPG",
            "caption": "Have a low profile, like this windmill like I just found yesterday."
         }
      ],
      "additional_images":[
         {
            "file_path":"/images/MWP_SIDE1.JPG",
            "heading":"Don't wait - get things done ASAP.",
            "caption_img":"You are the director of your life - make it a best seller.",
            "caption_outside":"Don't be afraid to take the leap of faith and expand that comfort zone.",
            "text_content":"I'm gradually increasing my confidence by making short films. I didn't really care much for what content they had, for the pleasure and memories were the things that were most valuable to me.\n\nThe greatest thing about technology is that we can become a powerful influence in the globe- it all takes a few clicks of the camera and the uttering of articulate words.\n\nI am by no means trying to say, create content for the sake of it. <q>Create things that generate value to others and especially yourself, stuff that aligns with your values.<a>Demie</a></q>\n\nGetting things done isn't always easy, when mental health is a struggle to maintain at times. Which is why I move on to the next point:",
            "alignment":"end",
            "obj_cover":"center",
            "height":"530px",
            "position_y":"-250px"
         },
         {
            "file_path":"/images/MWP_SIDE2.JPG",
            "heading":"Allow yourself to take breaks",
            "caption_img":"Taking breaks, and getting sleep, is equally as important as getting things done.",
            "caption_outside":"Remember that your body is like a machine. It requires resources, even sleep, to function normally.",
            "text_content":"I've taken a month or two break since writing my last article here. I felt like I needed it to be honest, because without it, I may not be able to regulate myself. I know this article turned into advice land all of a sudden, but it's true. You don't have to fall asleep to achieve your dreams either.",
            "height":"500px",
            "alignment":"end",
            "obj_cover":"center",
            "position_y":"-150px"
         }
      ]
   },

   {
      "id":15,
      "title":"Tired of Fake People",
      "tags":[
         "personal",
         "vent"
      ],
      "teaser_content":"Honestly, I'm tired of people pleasing and masking all the time.",
      "full_content":"Warning: Explicit Language\n\n\n\nIt's honestly exhausting to live in a world that only accepts a partial version of who I am, as if I'm living in a simulation. And even if I had the mask off, you wouldn't want to see every part of me. It's so awkward playing these stupid mind games. It's exhausting and soul sucking.\n\nNow let me clarify something blatantly obvious, and that is, not everyone is fake. But at times, even the most genuine appearing souls can show a bit of superficiality that can slip under the radar. For instance, certain YouTubers like MrBeast have not had drama up until just recently in 2024.\n\nWhat you see of me from this website is a subjective blueprint- however you interpret my articles is entirely yours to decide.\n\nIt's the reason why I've not been posting in this website for a little while. How does one even tackle the topic of authenticity when having to mask?\n\nThis is just an observation but I've come up with theories on why people have become more disconnected than ever.",
      "created_by":"Demie Mistica",
      "dateTime_created":"01/11/2024, 02:36",
      "dateTime_updated":"01/11/2024, 02:36",
      "grid_format_id":"1",
      "images":[
         {
            "file_path":"/images/tofp_1901.jpg",
            "caption":"Friend groups sometimes dissipate like butter in a hot pan.",
            "is_main_image":1
         }
      ],
      "additional_images":[
         {
            "file_path":"/images/pexels-boa-vision-914571-2239595.jpg",
            "heading":"The Enshittification of People",
            "caption_img":"People have become more distant than ever before.",
            "caption_outside":"I can't speak about certain issues because people are ingrained in their beliefs.",
            "text_content":"It's becoming ever harder than ever to find people who are open-minded and willing to engage in a conversation. I attribute it to the fact that people are becoming more superficial and wanting the high of getting validation more than ever. I value honesty and integrity more than anything else, yet people tend to distance from that in favour of professionalism.\n\nWhy should I contribute to a society that is this superficial and unwilling to start an open and honest conversation about things? Why do things have to be sugarcoated all the time? Even when I started this personal branding of my website, I couldn't believe that I had to do this in the first place.",
            "alignment":"end",
            "obj_cover":"bottom",
            "height":"530px",
            "position_y":"-250px"
         },
         {
            "file_path":"/images/pexels-cottonbro-7396383.jpg",
            "heading":"Ghosting",
            "caption_img":"Honestly, fuck being ghosted.",
            "caption_outside":"Whether it's through employment or through a friend, ghosting is a pain to deal with.",
            "text_content":"Ghosting is such a common thing now, especially through employment. I've dedicated my time to making the necessary documents to get this job, yet they don't give me any improvement or feedback to help.\n\nThe fact that people can't make the time to respond and give valuable feedback is astonishing, and I don't like that.",
            "height":"500px",
            "alignment":"end",
            "obj_cover":"center",
            "position_y":"-150px"
         },

         {
            "file_path":"/images/pexels-pixabay-355952.jpg",
            "heading":"Lack of Listening and Critical Thinking Skills",
            "caption_img":"I struggle with this a lot, and I can relate...",
            "caption_outside":"When someone is too nice at the start, it's most likely too good to be true.",
            "text_content":"I'm trying my best to be optimistic about people in general. However, sometimes it's really hard to believe that people have purely good intentions in the first place.\n\n It's really difficult to talk to someone who refuses to take responsibility for their actions, nor be able to listen to what others have to say.",
            "height":"500px",
            "alignment":"end",
            "obj_cover":"center",
            "position_y":"-150px"
         }
      ]
   },

   {
      "id":16,
      "title":"The Woes and Wonders of Mania",
      "tags":[
         "mental-health",
         "recovery"
      ],
      "teaser_content":"It's 3am, I'm bursting with ideas and I don't want to rest.",
      "full_content":"Let's be honest, some of us have pulled an all-nighter and likely end up regretting it later. But I can't help it sometimes, because I hate sleep schedules. Yet, if I want to grow, I'll eventually have to readjust to the world's body clock.\n\nThis article is about my experiences of mania. Restlessness, racing thoughts, unending energy levels, you name it. As unusual as it sounds, I feel like its strengths should be embraced. I'll even go as far as to say that without it, I wouldn't be a web developer.\n\nI want people to understand that it's totally okay to not have to follow societal norms. Ideas flow, and sometimes they come at the most awkward times.\n\nWhen I'm in manic mode, everything is stimulating. From the clicky sounds of my mechanical keyboard, to the dance music I'm listening to, it feels like I'm on top of the world. It's an addictive cycle.\n\nI might eat the most unhealthy foods too, because I don't have that ability to recognize my needs when I'm manic. Pizza? Burgers? Sign me up, the manic diet is a ravenous one.\n\nSelf-neglect is my main woe. Criticisms from others hurt a lot more, and I don't know how to deal with rejection when I'm in this phase. \n\nBut the main part of my mania is that it's a contributive phase. It's something that I would continue to work with until my eyes can no longer hold its eyelids.",
      "created_by":"Demie Mistica",
      "dateTime_created":"20/11/2024, 03:37",
      "dateTime_updated":"20/11/2024, 03:37",
      "grid_format_id":"1",
      "images":[
         {
            "file_path":"/images/TWOM_COVER_II.png",
            "caption":"My desk setup when I'm alone. Yes, it's full of LEDs and I don't mind.",
            "is_main_image":1
         }
      ],
      "additional_images":[
   
      ]
   },


   {
      "id":17,
      "title":"Dealing with Burnout",
      "tags":[
         "mental-health",
         "recovery"
      ],
      "teaser_content":"I need long, lengthy breaks whenever I code. Let's talk about this.",
      "full_content":"I'll be honest, coding burns me out so much. I've written this article as a warm up activity to slowly get me back into code.\n\nHonestly it's hard. I really want to do coding again, but at times, the burnout is undeniably strong that I cannot even muster up a single line.\n\nWhy is this so difficult? I just want to express my creativity, yet nothing is coming up. I've given myself several weeks to rest, yet none of that rest seems to have worked. ",
      "created_by":"Demie Mistica",
      "dateTime_created":"07/01/2025, 14:23",
      "dateTime_updated":"07/01/2025, 14:23",
      "grid_format_id":"1",
      "images":[
         {
        
            "file_path":"/images/Burnout_FerrisWheel.jpg",
            "caption":"I take walks to recover from burnout. It's very refreshing.",
            "is_main_image":1
         },

         {
            "file_path":"/images/Burnout_Cover.jpg",
            "caption":"I take walks to recover from burnout. It's very refreshing.",
            "is_main_image":0
         }
      ],
      "additional_images":[
         
      ]
   },

   {
      "id":18,
      "title":"I'm Not Sorry For Who I Am",
      "tags":[
         "mental-health",
         "forgiveness"
      ],
      "teaser_content":"Self-forgiveness is one of the most powerful tools in my arsenal. And no, it's not narcissistic to say that.",
      "full_content":"For years, I've grown up thinking that I was scum of the earth. Undeserving of any sympathy or a chance to even grow in life. It was due to the fact that I've hurt others along the way towards my own path of self interest.\n\nGrowing up autistic, I feel like a part of me will always mask who I am on the internet, no matter how deep these actions were. Because I've been so isolated growing up, I've learnt that the only way to grow is to go with the flow.\n\nThis article talks about self-forgiveness exclusively, because I feel like it's important for me and others to recognize the fact that no matter what sort of things you've gone through, if you want to become a better person, and on the path to doing so, you deserve a second chance in life.\n\nPart of the reason why I wanted to make this website in the first place was to allow myself to freely speak my mind without anyone stopping me. To allow me to unmask. To share my thoughts without the fear of being judged or having to censor them.\n\nRecently, I've had to distance myself from a handful of 'friends'. They broke me first however, as they were the ones to distance me in the first place. However, knowing that they don't want to be a part of their plans lets me know how much they value me- nada. I don't think I have to change who I am just to see them again.\n\nOne of the hardest things for me to realize was that I didn't always need permission from people to be myself.\n\n",
      "created_by":"Demie Mistica",
      "dateTime_created":"13/01/2025, 18:56",
      "dateTime_updated":"13/01/2025, 18:56",
      "grid_format_id":"1",
      "images":[
         {
            "file_path":"/images/INSFWIA_Cover.JPG",
            "caption":"There is no shame in taking pride of who you are. You just have to learn to accept yourself.",
            "is_main_image":1
         }
      ],
      "additional_images":[
            {
            "file_path":"/images/pexels-tara-winstead-6690237.jpg",
            "heading":"Self-Forgiveness comes from within",
            "caption_img":"Picture taken from Pexels | Tara Winstead",
            "caption_outside":"It can be really difficult to forgive oneself for their shortcomings. But positive affirmations can be the antidote.",
            "text_content":"Trust me when I say that I hate having to mask my own feelings. If I can't be fully honest to others, at least I can be fully honest to myself.\n\nThe road to recovery can be one of the roughest and most unreliable roads to ride on, even more so due to how abstract it is. My recovery car has broken down hundreds of times, yet to repair it doesn't require any physical parts. It requires a lot of reassurance, mental resilience, and patience. Skills that can be learnt over time.",
            "alignment":"end",
            "obj_cover":"left",
            "height":"530px",
            "position_y":"-250px"
         }
      ]
   },

   {
      "id":19,
      "title":"Resurfacing From The Dark",
      "tags":[
         "mental-health",
         "pep-talk"
      ],
      "teaser_content":"Coming back from a rut is difficult, especially with ADHD mixed in.",
      "full_content":"It took me nearly a full month to recover from coding burnout. Writing a single line wasn't easy, and I felt like I had to constantly rely on vices to keep me afloat.\n\nRecognizing that I was in a rut was the first step. However, that self-recognition is often too late, leaving me buried underneath a hole that's too deep to get out of without help.\n\nSo, by working hard and getting through the motions, whether it'd be my daily chores, to making websites, these actions create that rut hole unconsciously.\n\nI'm working my best to work on earlier recognition of when I do this. Here I name by best strategies for getting out of this rut.\n\n",
      "created_by":"Demie Mistica",
      "dateTime_created":"19/01/2025, 00:23",
      "dateTime_updated":"19/01/2025, 00:23",
      "grid_format_id":"1",
      "images":[
         {
            "file_path":"/images/RFTD_COVER.png",
            "caption":"There is light at the end of every tunnel- but also darkness inbetween.",
            "is_main_image":1
         }
      ],
      "additional_images":[
         
      ]
   },

   {
      "id":20,
      "title":"Tackling Uncertainty",
      "tags":[
         "introspection",
         "hindsight"
      ],
      "teaser_content":"Sometimes, you just have to go with the flow.",
      "full_content":"I'm coming to terms with the fact that my life can't always have the same routine everyday. Some parts of it will be unpredictable.\n\nFor instance, I may have to deal with an emergency, with my finances etc. With the cost of living crisis still at hand, it's really difficult to keep my head level at times, especially when I feel like I haven't managed my money very well.",
      "created_by":"Demie Mistica",
      "dateTime_created":"08/03/2025, 01:17",
      "dateTime_updated":"08/03/2025, 01:17",
      "grid_format_id":2,
      "images":[
         {
            "file_path":"/images/Dice.jpg",
            "caption":"Whatever hand of cards you've been given, there's always a chance of improving.",
            "is_main_image":1
         }
      ],
      "additional_images":[
         
      ]
   },

   {
      "id":21,
      "title":"Developing MyNutrition",
      "tags":[
         "web-dev",
         "hindsight",
         "frontend"
      ],
      "teaser_content":"Here are my design philosophies behind developing MyNutrition.",
      "full_content":"First things first, let me tell you what inspired me to make this website in the first place.\n\nI personally really struggle with my weight. I've really struggled to work on this, so I wanted to create a website that could make it easier not only for me but for others too!\n\nI decided to go for an orange colour scheme because I feel like nutrition and fitness is generally a really difficult discipline. I also feel like orange would be the best for giving the website its unique and passionate flair for those who are trying to achieve their goals.",
      "created_by":"Demie Mistica",
      "dateTime_created":"16/03/2025, 01:05",
      "dateTime_updated":"16/03/2025, 01:05",
      "grid_format_id":2,
      "images":[
         {
            "file_path":"/images/mynutrition logo white.png",
            "caption":"",
            "is_main_image":1
         }
      ],
      "additional_images":[
         {
            "file_path":"/images/mynutrition_banner 16032025.png",
            "heading":"The Header",
            "caption_img":"It has various slides!",
            "caption_outside":"I feel like the most eye-catching part of the page is the header, and I'm proud of how far it's come.",
            "text_content":"The header took a bit of creativity! I used JavaScript and CSS to make the text carousel and blobby hero image come to life.\n\n",
            "alignment":"end",
            "obj_cover":"left",
            "height":"530px",
            "position_y":"-250px"
         }
      ]
   },

   {
      "id":22,
      "title":"Giving Myself Permission",
      "tags":[
         "mental-health",
         "recovery"
      ],
      "teaser_content":"The last thing I want for myself is to feel like life isn't worth living.",
      "full_content":"I wanna get this off my chest. I constantly spiral and make myself feel insufferable, to the point where others notice my pain. It's been really difficult to look into the mirror lately when I'm even afraid to look at my own reflection. So I ask myself this:\n\n Why don't I pick myself for the first time? Why don't I start going to places not because others give me permission to, but because I allow myself to be part of the experience?\n\nSure there'll be some times where you aren't permitted to go to certain places, which in that case is totally valid, but sometimes you shouldn't have to seek others' permission to just be you.\n\nPart of showing a confident personality is KNOWING when to take that initiative. Without anyone else telling you to, when to start that project and meet the deadline, and knowing when things get tough that you have to pace things up.\n\nBuilding that confidence can be very hard when all I've ever known is seeking it from others. I know how hard it is to really come up with something tangible.\n\nI know I talk about mental health a lot on this website, which can seem off-putting, but I feel like it is such an integral part of my identity to talk about issues that affect so many people, that I think if even one other were to read this article, I'd be really proud to have spread my word.",
      "created_by":"Demie Mistica",
      "dateTime_created":"21/06/2025, 03:30",
      "dateTime_updated":"21/06/2025, 03:30",
      "grid_format_id":2,
      "images":[
         {
            "file_path":"/images/APTBM_HERO_V2.JPG",
            "caption":"",
            "is_main_image":1
         }
      ]
   },

   {
      "id":23,
      "title":"Blossoming to Independence - Pt II",
      "tags":[
         "mental-health",
         "recovery"
      ],
      "teaser_content":"Independence is something I’ve always struggled with, since I’ve grown up in a culture that stifles it to its very core.",
      "full_content":"<t>Have you tried the accessibility buttons on the top right (or hamburger menu on mobile)? The first button activates dark/light mode, whereas the second is a 'dyslexic-friendly' font! Give them a go!</t>\nToday, I’ve decided to leave my past baggage behind. And if I ever think about those past memories that live in my head rent free, that I’m not going to entertain these thoughts and just process them as is.\n\nIn order to establish my independence, the main component is being able to take responsibility for everything that is within my control- My feelings, thoughts, and actions. I’ve learnt a hefty lesson from letting others carry my burdens at times when I was perfectly capable of handling them myself.\n\n So to commemorate nearly a year of writing Part 1 of this article, I’m going to turn a new leaf. Not only for myself but for my future self. My past self would be proud knowing that I’ve invested time in my mental health, because it can be hard to be at your best when you are your own worst enemy.",
      "created_by":"Demie Mistica",
      "dateTime_created":"23/06/2025, 03:30",
      "dateTime_updated":"23/06/2025, 03:30",
      "grid_format_id":2,
      "images":[
         {
            "file_path":"/images/BTI_PT2_HERO.png",
            "caption":"A faithful update to my growth towards independence.",
            "is_main_image":1
         }
      ],

       "additional_images":[
         {
            "file_path":"/images/BTI_PT2_Rekindling_Flame.jpg",
            "heading":"Reigniting That Flame",
            "caption_img":"A flame that is twice as bright, burns twice as fast.",
            "caption_outside":"A small bit of light never hurt anyone.",
            "text_content":" Sometimes, it can be really difficult to gather the strength to light up the strength in your heart. When really, all it really took was to mentally believe in oneself, through the things you do and what you stand for.\n\nSometimes the strongest flames come from doing the things you love, to the point where you even forget that you had a self-grudge to begin with. Being proud of who you are should not be confused with thinking you are better than everyone else.\n\n There’s a thin line between arrogance and confidence that tends to easily be overlooked. Some people love to extinguish your flames, just because they can. They want to see you fail. They think by quelling your flames, that theirs grows brighter. Such is not the case in this modern world. Growth and collaboration starts with a strong sense of independence. ",
            "alignment":"end",
            "obj_cover":"left",
            "height":"530px",
            "position_y":"-250px"
         },

         {
            "file_path":"/images/BTI_PT2_2.JPG",
            "heading":"Independence does not come overnight",
            "caption_img":"Take this sculpture as your destination. To get there, you have to independently visit it.",
            "caption_outside":"Appreciating where you are now can go a long way towards paving your future.",
            "text_content":"It took me many, many years to realize that even after moving in my house in mid-2021, fast forward to 2025, that I still have a LOT to learn. I have to learn how to look after myself, make ends meet, and upkeep my connections from time to time.\n\nThough, you don't have to face things alone all the time. There will be times where no one can help you, but if at any point you get stuck in your own personal journey being unable to answer questions for yourself, it is NEVER a bad thing to ask for help from the right people. <q>It ain't a bad thing to ask for help, don't make you less of a person.<a>Cruisin - Huey Mack</a></q>",
            "alignment":"center",
            "obj_cover":"bottom",
            "height":"530px",
            "position_y":"-250px"
         }
      ]
   }
 ]